In [1]:
import pandas as pd

providers = pd.read_csv("providers_data.csv")
receivers = pd.read_csv("receivers_data.csv")
food_listings = pd.read_csv("food_listings_data.csv")
claims = pd.read_csv("claims_data.csv")

In [2]:
providers

,Provider_ID,Name,Type,Address,City,Contact
0,1,Gonzales-Cochran,Supermarket,"74347 Christopher Extensions\nAndreamouth, OK ...",New Jessica,+1-600-220-0480
1,2,"Nielsen, Johnson and Fuller",Grocery Store,"91228 Hanson Stream\nWelchtown, OR 27136",East Sheena,+1-925-283-8901x6297
2,3,Miller-Black,Supermarket,"561 Martinez Point Suite 507\nGuzmanchester, W...",Lake Jesusview,001-517-295-2206
3,4,"Clark, Prince and Williams",Grocery Store,"467 Bell Trail Suite 409\nPort Jesus, IA 61188",Mendezmouth,556.944.8935x401
4,5,Coleman-Farley,Grocery Store,"078 Matthew Creek Apt. 319\nSaraborough, MA 53978",Valentineside,193.714.6577
...,...,...,...,...,...,...
995,996,"Vasquez, Ruiz and Flowers",Restaurant,"84308 Justin Stravenue\nNew Amberside, NE 53447",Williamview,+1-319-378-7627x0682
996,997,Garza-Williams,Catering Service,"08864 Figueroa Radial Suite 948\nJennaberg, AZ...",East Rossside,001-924-441-3963x746
997,998,Novak Group,Grocery Store,"934 Zachary Run\nMelissamouth, WY 02729",Joshuastad,(903)642-1969x3300
998,999,Moody Ltd,Grocery Store,"17580 Ernest Hills\nLake Michaelmouth, OR 56416",Stevenchester,637.300.3664x4880
999,1000,Jenkins-Brooks,Restaurant,"53390 Evans Rapids Suite 982\nLake Meghan, MO ...",Brendantown,266-324-3458x95775

In [3]:
receivers

,Receiver_ID,Name,Type,City,Contact
0,1,Donald Gomez,Shelter,Port Carlburgh,(955)922-5295
1,2,Laurie Ramos,Individual,Lewisburgh,761.042.1570
2,3,Ashley Mckee,NGO,South Randalltown,691-023-0094x856
3,4,Erika Rose,NGO,South Shaneville,8296491111
4,5,John Romero,Individual,Bakerport,067.491.0154
...,...,...,...,...,...
995,996,Matthew Curtis,Shelter,Lanechester,127-889-4442x1289
996,997,Amanda Cain,NGO,New Steven,+1-001-491-5601x5316
997,998,Theodore Briggs,Individual,South Sandra,930-609-9442x5031
998,999,Cheyenne Ramsey,NGO,Lake Jeffery,001-326-320-4816x15300
999,1000,April Miller,Shelter,Shelbychester,894-873-2652x23999

In [4]:
food_listings

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,3/17/2025,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,3/24/2025,791,Grocery Store,West James,Non-Vegetarian,Dinner
2,3,Fruits,46,3/28/2025,478,Catering Service,Lake Regina,Vegan,Breakfast
3,4,Fruits,15,3/16/2025,930,Restaurant,Kellytown,Vegan,Lunch
4,5,Soup,14,3/19/2025,279,Restaurant,Garciaport,Vegan,Dinner
...,...,...,...,...,...,...,...,...,...
995,996,Fish,15,3/30/2025,467,Catering Service,Phillipsfort,Vegan,Breakfast
996,997,Fish,22,3/18/2025,35,Grocery Store,Andersonmouth,Vegetarian,Breakfast
997,998,Fruits,6,3/22/2025,444,Restaurant,New Billy,Non-Vegetarian,Dinner
998,999,Pasta,15,3/30/2025,702,Supermarket,Lake Mistyton,Non-Vegetarian,Lunch
999,1000,Salad,18,3/19/2025,155,Supermarket,Charlesview,Non-Vegetarian,Dinner

In [5]:
claims

     Claim_ID  Food_ID  Receiver_ID     Status        Timestamp
0           1      164          908    Pending    3/5/2025 5:26
1           2      353          391  Cancelled  3/11/2025 10:24
2           3      626          492  Completed   3/21/2025 0:59
3           4       61          933  Cancelled    3/4/2025 9:08
4           5      345          229    Pending  3/14/2025 15:17
..        ...      ...          ...        ...              ...
995       996      855          211  Completed  3/13/2025 19:40
996       997      980          746  Cancelled  3/17/2025 22:04
997       998      832          967  Cancelled  3/13/2025 18:00
998       999      917           90  Completed   3/1/2025 15:31
999      1000      596          950  Cancelled  3/13/2025 12:51

[1000 rows x 5 columns]

In [6]:
import sqlite3

In [7]:
conn = sqlite3.connect("food_wastage.db")
cursor = conn.cursor()

In [8]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS providers (
        Provider_ID INTEGER PRIMARY KEY,
        Name TEXT,
        Type TEXT,
        Address TEXT,
        City TEXT,
        Contact TEXT
    )
''')

In [9]:
for index, row in providers.iterrows():
    cursor.execute("""
        INSERT INTO providers (Provider_ID, Name, Type, Address, City, Contact)
        VALUES (?, ?, ?, ?, ?, ?)
    """, tuple(row))

In [10]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS receivers (
        Receiver_ID INTEGER PRIMARY KEY,
        Name TEXT,
        Type TEXT,
        City TEXT,
        Contact TEXT
    )
''')

In [11]:
for index, row in receivers.iterrows():
    cursor.execute("""
        INSERT INTO receivers (Receiver_ID, Name, Type, City, Contact)
        VALUES (?, ?, ?, ?, ?)
    """, tuple(row))

In [12]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS food_listings (
        Food_ID INTEGER PRIMARY KEY,
        Food_Name TEXT,
        Quantity TEXT,
        Expiry_Date TEXT,
        Provider_ID TEXT,
        Provider_Type TEXT,
        Location TEXT,
        Food_Type TEXT,
      	Meal_Type TEXT
    )
''')

In [13]:
for index, row in food_listings.iterrows():
    cursor.execute("""
        INSERT INTO food_listings (Food_ID, Food_Name, Quantity, Expiry_Date, Provider_ID, Provider_Type, Location, Food_Type, Meal_Type)
        VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
    """, tuple(row))

In [14]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS claims (
        Claim_ID INTEGER PRIMARY KEY,
        Food_ID TEXT,
        Receiver_ID TEXT,
        Status TEXT,
        Timestamp TEXT

    )
''')

In [15]:
for index, row in claims.iterrows():
    cursor.execute("""
        INSERT INTO claims (claim_ID, Food_ID, Receiver_ID, Status, Timestamp)
        VALUES (?, ?, ?, ?, ?)
    """, tuple(row))

1. How many food providers and recivers are there in each city?

In [16]:
query= ("""
    SELECT City, COUNT(*) AS Total,'Providers' AS Type
    FROM providers
    GROUP BY City

    UNION ALL

    SELECT City, COUNT(*) AS Total,'Receivers' AS Type
    FROM receivers
    GROUP BY City;
""")

df = pd.read_sql_query(query, conn)
df

                  City  Total       Type
0             Adambury      1  Providers
1            Adamsview      1  Providers
2           Adamsville      1  Providers
3         Aguirreville      1  Providers
4     Alexanderchester      1  Providers
...                ...    ...        ...
1924       Woodardview      1  Receivers
1925         Woodsfurt      1  Receivers
1926        Wrightland      1  Receivers
1927          Wyattton      1  Receivers
1928       Zacharyview      1  Receivers

[1929 rows x 3 columns]

2. Which type of food provider (restaurant, grocery store etc) contributes the most food?

In [17]:
query = """ 
SELECT Provider_Type, SUM(Quantity) AS Total_Quantity
FROM food_listings
GROUP BY Provider_Type
ORDER BY Total_Quantity DESC;
"""

df = pd.read_sql_query(query, conn)
df

      Provider_Type  Total_Quantity
0        Restaurant            6923
1       Supermarket            6696
2  Catering Service            6116
3     Grocery Store            6059

3. What is the contact information of food providers in specific city?

In [18]:
query = """
SELECT Name, Contact
FROM providers
WHERE City = 'East Sheena';
"""

df = pd.read_sql_query(query, conn)
df

                          Name               Contact
0  Nielsen, Johnson and Fuller  +1-925-283-8901x6297

4. Which receivers have claimed the most food?

In [19]:
query = """
SELECT r.Name, COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN receivers r ON c.Receiver_ID = r.Receiver_ID
GROUP BY r.Name
ORDER BY Total_Claims DESC;
"""

df = pd.read_sql_query(query, conn)
df

                  Name  Total_Claims
0    William Frederick             5
1         Scott Hunter             5
2         Matthew Webb             5
3       Anthony Garcia             5
4      Kristine Martin             4
..                 ...           ...
615          Alex Leon             1
616      Alan Campbell             1
617      Adam Browning             1
618        Aaron Scott             1
619       Aaron Keller             1

[620 rows x 2 columns]

5. What is the total quantity of food available from all providers?

In [20]:
query = """
SELECT SUM(Quantity) AS Total_Quantity 
FROM food_listings;
"""

df = pd.read_sql_query(query, conn)
df

   Total_Quantity
0           25794

6. Which city has the highest number of food listings?

In [21]:
query = """
SELECT Location AS City, COUNT(*) AS Total_Listings
FROM food_listings
GROUP BY Location
ORDER BY Total_Listings DESC;
"""

df = pd.read_sql_query(query, conn)
df

                 City  Total_Listings
0       South Kathryn               6
1           New Carol               6
2           Perezport               5
3           Jimmyberg               5
4         East Angela               5
..                ...             ...
619     Andersonmouth               1
620       Amandashire               1
621      Allenborough               1
622  Alexanderchester               1
623          Adambury               1

[624 rows x 2 columns]

7. What are most commonly available food types?

In [22]:
query = """
SELECT Food_Type, COUNT(*) AS Count
FROM food_listings
GROUP BY Food_Type
ORDER BY Count DESC;
"""

df = pd.read_sql_query(query, conn)
df

        Food_Type  Count
0      Vegetarian    336
1           Vegan    334
2  Non-Vegetarian    330

8. How many food claims have been made for each food item?

In [23]:
query = """
SELECT f.Food_Name, COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
ORDER BY Total_Claims DESC;
"""

df = pd.read_sql_query(query, conn)
df

  Food_Name  Total_Claims
0     Dairy          1000

9. Which provider has had the highest number of successful food claims?

In [24]:
query = """
SELECT p.Name, COUNT(c.Claim_ID) AS Successful_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN providers p ON f.Provider_ID = p.Provider_ID
WHERE c.Status = 'Completed'
GROUP BY p.Name
ORDER BY Successful_Claims DESC;
"""

df = pd.read_sql_query(query, conn)
df

                                Name  Successful_Claims
0                        Barry Group                  5
1                         Miller Inc                  4
2        Harper, Blake and Alexander                  4
3                  Butler-Richardson                  4
4          Barnes, Castro and Curtis                  4
..                               ...                ...
243    Anderson, Nicholson and Bruce                  1
244                 Allen-Mccullough                  1
245  Allen, Zimmerman and Harrington                  1
246                    Alexander PLC                  1
247        Abbott, Brooks and Moreno                  1

[248 rows x 2 columns]

10. What percentage of food claims are completed vs. pending vs. canceled?

In [25]:
query = """
SELECT Status, COUNT(*) * 100.0 / (SELECT COUNT(*) FROM claims) AS Percentage 
FROM claims
GROUP BY Status;
"""

df = pd.read_sql_query(query, conn)
df

      Status  Percentage
0  Cancelled        33.6
1  Completed        33.9
2    Pending        32.5

11. What is the average quantity of food claimed per receiver?

In [26]:
query = """
SELECT r.Name, AVG(f.Quantity) AS Avg_Claimed_Quantity
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN receivers r ON c.Receiver_ID = r.Receiver_ID
GROUP BY r.Name;
"""

df = pd.read_sql_query(query, conn)
df

                  Name  Avg_Claimed_Quantity
0         Aaron Keller             39.000000
1           Aaron Rios             21.000000
2          Aaron Scott             45.000000
3     Abigail Crawford             25.666667
4        Adam Browning              5.000000
..                 ...                   ...
615     William Barnes             47.000000
616        William Fox             12.000000
617  William Frederick             21.400000
618     Yvette Huffman             45.000000
619      Zachary Lewis             22.000000

[620 rows x 2 columns]

12.Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [27]:
query = """
SELECT f.Meal_Type, COUNT(*) AS Claim_Count
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Meal_Type
ORDER BY Claim_Count DESC;
"""

df = pd.read_sql_query(query, conn)
df

   Meal_Type  Claim_Count
0  Breakfast          278
1      Lunch          250
2     Snacks          240
3     Dinner          232

13. What is the total quantity of food donated by each provider?

In [28]:
query = """
SELECT p.Name, SUM(f.Quantity) AS Total_Donated
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Name
ORDER BY Total_Donated DESC;
"""

df = pd.read_sql_query(query, conn)
df

                                Name  Total_Donated
0                         Miller Inc            217
1                        Barry Group            179
2         Evans, Wright and Mitchell            158
3                        Smith Group            150
4                       Campbell LLC            145
..                               ...            ...
623                   Reyes and Sons              1
624                  Norris-Townsend              1
625                        Mcgee PLC              1
626  Martinez, Armstrong and Carroll              1
627                   Gonzales-Moore              1

[628 rows x 2 columns]

14. How many expired food items are still listed?

In [29]:
query = """
SELECT COUNT(*) AS Expired_Items
FROM food_listings
WHERE Expiry_Date < Date('now');
"""

df = pd.read_sql_query(query, conn)
df

   Expired_Items
0              0

15. What are the toP 5 cities with the highest completed claims?

In [30]:
query = """
SELECT f.Location AS City, COUNT(*) AS Completed_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
WHERE c.Status ='Completed'
GROUP BY f.Location
ORDER BY Completed_Claims DESC
LIMIT 5;
"""

df = pd.read_sql_query(query, conn)
df

               City  Completed_Claims
0     South Kathryn                 5
1    Zimmermanville                 4
2         New Carol                 4
3  East Heatherport                 4
4        Devinmouth                 4

16. What are the top 5 most donated food items?

In [31]:
query = """
SELECT Food_Name, SUM(Quantity) AS Total_Donated
FROM food_listings
GROUP BY Food_Name
ORDER BY Total_Donated DESC
LIMIT 5;
"""

df = pd.read_sql_query(query, conn)
df

  Food_Name  Total_Donated
0      Rice           3133
1      Soup           2819
2     Salad           2765
3     Dairy           2765
4     Bread           2726

17. How many inactive providers?

In [32]:
query = """
SELECT p.Name, p.City
FROM providers p
LEFT JOIN food_listings f ON p.Provider_ID = f.Provider_ID
WHERE f.Food_ID IS NULL;
"""

df = pd.read_sql_query(query, conn)
df

                             Name               City
0                    Miller-Black     Lake Jesusview
1                  Lawson-Walters        Shannonside
2                    Curtis-Lewis    Washingtonville
3                      Miller Ltd  East Williamburgh
4     Parker, Flores and Jennings         Nicolefort
..                            ...                ...
358  Morris, Serrano and Roberson         East Laura
359                   Spencer LLC     Stevensborough
360                Miller-Sanders      Browninghaven
361    Porter, Hernandez and Pace            Amyport
362     Vasquez, Ruiz and Flowers        Williamview

[363 rows x 2 columns]

18. Claims trend over time

In [33]:
query = """
SELECT DATE(Timestamp) AS Claim_Date, COUNT(*) AS Total_Claim
FROM claims
GROUP BY Claim_Date
ORDER BY Claim_Date ASC;
"""

df = pd.read_sql_query(query, conn)
df

  Claim_Date  Total_Claim
0       None         1000

19. Claims trend by city

In [34]:
query = """
SELECT f.Location AS City, COUNT(*) AS Total_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Location 
ORDER BY Total_Claims DESC;
"""

df = pd.read_sql_query(query, conn)
df

                 City  Total_Claims
0    East Heatherport            12
1    Lake Andrewmouth             9
2           Jamesfurt             9
3       South Kathryn             7
4           New Carol             7
..                ...           ...
463      Anthonyshire             1
464    Anthonyborough             1
465     Andersonville             1
466       Amandashire             1
467      Allenborough             1

[468 rows x 2 columns]

20. Claims made after food expiry

In [35]:
query = """
SELECT c.Claim_ID, f.Food_Name, f.Expiry_Date, c.Timestamp
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
WHERE DATE(c.Timestamp) > DATE(f.Expiry_Date);
"""

df = pd.read_sql_query(query, conn)
df

Empty DataFrame
Columns: [Claim_ID, Food_Name, Expiry_Date, Timestamp]
Index: []

21. Providers without any food listings

In [36]:
query = """
SELECT p.Provider_ID, p.Name, p.City
FROM providers p
LEFT JOIN fooD_listings f ON p.Provider_ID = f.Provider_ID
WHERE f.Food_ID IS NULL;
"""

df = pd.read_sql_query(query, conn)
df

     Provider_ID                          Name               City
0              3                  Miller-Black     Lake Jesusview
1              6                Lawson-Walters        Shannonside
2              8                  Curtis-Lewis    Washingtonville
3             12                    Miller Ltd  East Williamburgh
4             13   Parker, Flores and Jennings         Nicolefort
..           ...                           ...                ...
358          988  Morris, Serrano and Roberson         East Laura
359          991                   Spencer LLC     Stevensborough
360          992                Miller-Sanders      Browninghaven
361          994    Porter, Hernandez and Pace            Amyport
362          996     Vasquez, Ruiz and Flowers        Williamview

[363 rows x 3 columns]

22. Meal type vs. quantity donated

In [37]:
query = """
SELECT Meal_Type, SUM(Quantity) AS Total_Quantity
FROM food_listings
GROUP BY Meal_Type
ORDER BY Total_Quantity DESC;
"""

df = pd.read_sql_query(query, conn)
df

   Meal_Type  Total_Quantity
0     Snacks            6693
1  Breakfast            6667
2      Lunch            6373
3     Dinner            6061

23. Distribution of food types donated

In [38]:
query = """
SELECT Food_Type, COUNT(*) AS Total_Listings
FROM food_listings
GROUP BY Food_Type
ORDER BY Total_Listings DESC;
"""

df = pd.read_sql_query(query, conn)
df

        Food_Type  Total_Listings
0      Vegetarian             336
1           Vegan             334
2  Non-Vegetarian             330